package DataSimulation;

import java.util.Random;

public class nameCreator {
    private static String lastname = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟";
    private static String firstname1 =
            "寄梅代薇南青映冬巧安醉琴幼儿夏曼幼彤诗莲青丹若巧山荷惜旋含芹初云笑丹含蓝诗寒芷容亦旋怀玉惜蓉春梅冷巧凌香恨巧访双沛露念云梦蓉醉蕊友安念露如萍白蕾映薇春荷绿秋惜阳寻翠尔蕾半真寒香寄桃乐莲之枫晓玉宛容惜卉元秋初彤以风醉云惜荷映蕾雅菡千凡含双乐丝千儿凝晴天霜谷梦亦霜诗白问珍水菡青文语双醉桃访薇秋菱半旋问香冷菡夜岚春露曼南晓儿白珍安凡灵菡宛阳涵蓉雨安痴秋雁槐元芙问彤谷岚代槐迎芙雅云半凡又文春蕾青风芷柏采海雁萍水枫雪珊雅蕾念兰丹文梦天听容绮旋春安秋槐觅丝恨柏春易雪阳代青夜萍幼波问阳涵丝友筠尔荷凡柔醉南海晴雪萍涵香宛霜痴荷盼灵如凝问雪凌玉映香忆蝶夜风代梅凝蕾迎菱雁容寄海元南曼槐夏春又旋香旋初灵惜山以卉紫荷凝荷盼筠妙蕊映兰访枫易夏觅筠惜雁惜雪芷白迎芹从晴天亦巧兰醉海书巧绿青水梅水丹恨兰梦丝惜菱新双访烟盼槐冰枫青槐寻芹雁蕊冷蓝飞香凌蝶雁凝丹易秋夏绮寒醉珊天蓝寻翠青晴依夏之文傲云雅柔香儿丹晴幼曼宛香海槐慕雪碧容凡阳新之思雪凌之友凝恨梦绮丹小雪涵梦问蕊宛菱之曼沛阳新丝怜波夜芹易筠碧白白曼千之之青冰枫寻天代翠曼天水玉向绿盼瑶凝烟紫彤曼霜听夏碧柔怀夏翠兰山冬雨珍靖灵翠露尔蕾千灵绿珊思山凝露如波晓白梦薇采丹孤曼慕白静云春巧访海问易孤彤山芹静容依儿思蕾妙蓉寻丹诗阳友烟盼翠之荷觅凡灵文涵枫千儿丹柏觅梦念海新竹又凝怀珊梦巧凡海从雪惜蕾凝之夜卉绿晴宛彤山容春风映阳夏柳紫蓝笑彤元蕾翠柏书桃醉烟友蕾幼卉念霜新卉惜儿恨玉安天晓安青兰从波孤寒秋文晓夏南薇凝青采蝶之雪谷风碧薇依彤水琴亦秋绮萱飞梦傲珍诗荷靖芙冰槐雨蕾山梅雪翠孤云凌卉半巧寒风笑柔飞梦静蝶紫凝冬卉绿烟凝彤元易寻亦恨晴千凝觅珊曼珍映柔初白夜云海天巧春冷亦冰筠涵天寒竹亦蝶之芙丹雪香枫紫蓝念槐迎香水柔念波青枫巧灵孤凡笑露傲蓉映蕊白蕊灵曼友云孤香忆芹天菡曼丝慕菱思凝绿青晓荷紫易采珍采丝芷香白天觅安盼梅灵松冰松南露问香碧萍紫筠安凡友晴亦春凌荷青之笑梦半雪绮绿青烟迎珍之凡晓萱寒梅如云翠南怜蕾惜霜迎真思薇之柏冷云恨芹碧白听寒幻天谷柔初卉水青问蕊灵双寒萱乐露芷菱又露灵芹易柔千寒元芹巧南寄云妙海向菱幻霜觅凝笑蕊翠波念寒迎寒元薇雅南涵海冷玉谷蓉以晴怜丝从丹如巧忆风醉蝶秋儿亦秋春萍芷琴问旋青露傲云幼蝶水荷乐蓉语珍恨安冷柔映之妙冬梦柔怀丝痴柳乐凝丹卉初梅凝柳迎荷小彤尔蓉梦岚冬亦飞亦雅旋代珍忆亦翠彤千晴念蕊易玉涵玉初彤之柳谷曼飞桃平莲春亦映荷雅玉怜卉";
    private static String firstname2=
            "鹏涛炎彬鹤轩越彬风华靖琪明诚高格光华国源冠宇晗昱涵润翰飞嘉懿煜城懿轩烨伟苑博伟泽熠彤鸿煊博涛烨霖烨华煜祺智宸正豪建辉晋鹏天磊绍辉泽洋明轩健柏鹏煊昊强伟宸博超君浩子骞明辉昊然明杰立诚立轩立辉峻熙弘文熠彤鸿煊烨霖哲瀚鑫鹏致远俊驰瑾瑜皓轩擎苍擎宇志泽睿渊楷瑞子轩弘文哲瀚雨泽鑫磊修杰伟诚翰海昊乾浩博和安弘博宏恺鸿朗华奥华灿嘉慕坚秉建明金鑫锦程雨泽烨磊晟睿天佑文昊修洁黎昕远航旭尧鸿涛伟祺荣轩越泽浩宇修筠飞宇志强正谊远鸿厉轩旭尧世明泰佑健东泽欧智旭昊空智阳雅达子明泰舟韵轩昊宇远舟晋贤智瀚鼎名君旭英卫鹤骞凯复骏伟自珍宜然新霁俊喆辉轩泽晋胜强智新博裕建茗博简和风以升其昌乃亮若凯睿瀚棋凡楠云晋野子晋宏儒康裕华采轩龙尧恩志瑞韵依嘉祥高翰天罡宇寰泽君鼎冠彬茂浩君永春文轩飞尘宣朗元武鸿光康平鸿朗明辉景辉和光鸿熙高峯华奥恺歌阳夏翰池志文鹏翼承教德哲雨豪弘道星尚圣伯豪俊博天展天博翎荣翰世元浩秉博玮健邦泽帆鸿新兴学泽宇波涛浩涆温文旭东乐意宾白浩坤世恒文舟仁杰华彩涵衍良翰高寒良朋翰学辰龙鸿振宇达飞驰高峻飞捷涛皓泽兴浩强博云君乾弘昌菲鸿涛奇云龙浩波弘奇浩奇高远圣哲鼎瀚智城杰良博鸿玮尧旭玮长平鸿风睿才文翰元洲才捷安歌修永哲诚彬新浩宇德翔才英文赋兴庆骞北理群茂彦敏博明达朋义彭泽鹏举华奥华灿嘉慕坚秉建明金鑫锦程昊然明杰立诚立轩立辉峻熙弘文鸿煊博涛烨霖烨华煜祺智宸正豪濮存溥心璞瑜浦泽奇邃祺祥荣轩高格光华国源冠宇晗昱涵润翰飞远航旭尧鸿涛伟祺荣轩越泽浩宇泰宁天佑同巍奕伟祺温文虹向笛建辉晋鹏天磊绍辉泽洋明轩健柏季同开济凯安康成乐语力勤良哲熠彤鸿煊烨霖哲瀚鑫鹏致远俊驰心远欣德新翰兴言星阑修为旭尧子轩弘文哲瀚雨泽鑫磊修杰伟诚永贞咏德宇寰雨泽玉韵越彬蕴和鹏涛炎彬鹤轩越彬风华靖琪明诚嘉懿煜城懿轩烨伟苑博伟泽熠彤瑾瑜晋鹏经赋景同靖琪君昊俊明哲彦振海正志子晋自怡德赫君平炫明学真雪风雅昶阳曦烨熠英韶锐达睿慈绍祺圣杰晟睿思源斯年翰海昊乾浩博和安弘博宏恺鸿朗雨泽烨磊晟睿天佑文昊修洁黎昕瑾瑜皓轩擎苍擎宇志泽睿渊楷瑞鹏煊昊强伟宸博超君浩子骞明辉";

    public static String getName(int gender) throws InvalidGenderException{
        Random rand = new Random();
        String ln = String.valueOf(lastname.charAt(rand.nextInt(lastname.length())));
        if(gender == 0 ){
            int count = rand.nextInt(1,3);
            int origin = rand.nextInt(494);
            String fn1 = firstname1.substring(2*origin,2*origin+count);
            return ln+fn1+"F";
        }
        else if(gender == 1){
            int count = rand.nextInt(1,3);
            int origin = rand.nextInt(426);
            String fn2 = firstname2.substring(2*origin,2*origin+count);
            return ln+fn2+"M";
        }
        else throw new InvalidGenderException();
    }
    public static String getName() throws InvalidGenderException {
        Random rand = new Random();
        int gender = rand.nextInt(0,2);
        return getName(gender);
    }
    public static class Test{
        public static void main(String[] args) throws InvalidGenderException {
            for(int i =0;i<5;i++)
                System.out.println(getName());

        }
    }
}

class InvalidGenderException extends Exception{}
